export const FIGURES = [
  {
    id: "L",
    size: "medium", // площадь: 4 (1+1+1+1)
    shapes: [
      [[1,0],[1,0],[1,1]],
      [[1,1,1],[1,0,0]],
      [[1,1],[0,1],[0,1]],
      [[0,0,1],[1,1,1]],
      [[1,1],[1,0],[1,0]],
      [[1,1,1],[0,0,1]],
      [[0,1],[0,1],[1,1]],
      [[1,0,0],[1,1,1]]
    ],
  },
  {
    id: "square3",
    size: "large", // площадь: 9 (3x3)
    shapes: [
      [
        [1,1,1],
        [1,1,1],
        [1,1,1]
      ]
    ],
  },
  {
    id: "square2",
    size: "medium", // площадь: 4 (2x2)
    shapes: [
      [
        [1,1],
        [1,1]
      ]
    ],
  },
  {
    id: "dot",
    size: "small", // площадь: 1
    shapes: [
      [
        [1]
      ]
    ],
  },
  {
    id: "Z",
    size: "medium", // площадь: 4 (пример [1,1,0],[0,1,1])
    shapes: [
      [
        [1,1,0],
        [0,1,1]
      ],
      [
        [0,1,1],
        [1,1,0]
      ],
      [
        [0,1],
        [1,1],
        [1,0]
      ],
      [
        [1,0],
        [1,1],
        [0,1]
      ]
    ],
  },
  {
    id: "cross",
    size: "medium", // площадь: 5 (в форме крестика)
    shapes: [
      [
        [0,1,0],
        [1,1,1],
        [0,1,0]
      ]
    ],
  },
  {
    id: "line",
    size: null, // это теперь зависит от формы, так как разные длины имеют разные размеры
    shapes: [
      { pattern: [[1,1,1]], size: "small" },
      { pattern: [[1],[1],[1]], size: "small" },

      { pattern: [[1,1,1,1]], size: "medium" },
      { pattern: [[1],[1],[1],[1]], size: "medium" },

      { pattern: [[1,1,1,1,1]], size: "large" },
      { pattern: [[1],[1],[1],[1],[1]], size: "large" },

      { pattern: [[1,1,1,1,1,1]], size: "large" },
      { pattern: [[1],[1],[1],[1],[1],[1]], size: "large" },
    ],
  },
  {
    id: "pyramid",
    size: "medium", // площадь: 4 ([0,1,0],[1,1,1])
    shapes: [
      [
        [0,1,0],
        [1,1,1]
      ],
      [
        [1,0],
        [1,1],
        [1,0]
      ],
      [
        [1,1,1],
        [0,1,0]
      ],
      [
        [0,1],
        [1,1],
        [0,1]
      ]
    ],
  },
  {
    id: "diagonal",
    size: "small", // площадь: 2 ([1,0],[0,1])
    shapes: [
      [
        [1,0],
        [0,1]
      ],
      [
        [0,1],
        [1,0]
      ],
      [
        [1,0,0],
        [0,1,0],
        [0,0,1]
      ],
      [
        [0,0,1],
        [0,1,0],
        [1,0,0]
      ]
    ],
  },
  {
    id: "halfcorner2",
    size: "small", // площадь: 3 ([1,0],[1,1])
    shapes: [
      [
        [1,0],
        [1,1]
      ],
      [
        [0,1],
        [1,1]
      ],
      [
        [1,1],
        [1,0]
      ],
      [
        [1,1],
        [0,1]
      ],
    ],
  },
  {
    id: "halfcorner3",
    size: "medium", // площадь: 6 ([1,1,1],[1,0,0],[1,0,0])
    shapes: [
      [
        [1,1,1],
        [1,0,0],
        [1,0,0]
      ],
      [
        [1,1,1],
        [0,0,1],
        [0,0,1]
      ],
      [
        [1,0,0],
        [1,0,0],
        [1,1,1]
      ],
      [
        [0,0,1],
        [0,0,1],
        [1,1,1]
      ],
    ],
  }
];
